tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "xwmx/taps"
brew "adr-tools"
brew "antibody"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "aspell"
brew "awscli"
brew "bat"
brew "bison"
brew "ccat"
brew "cmake"
brew "curl"
brew "dog"
brew "gettext"
brew "pkg-config"
brew "emacs", restart_service: true
brew "entr"
brew "exa"
brew "exercism"
brew "fd"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "fzy"
brew "gh"
brew "jpeg"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnupg"
brew "httpie"
brew "hub"
brew "hyperfine"
brew "icu4c"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libxslt"
brew "libzip"
brew "markdown"
brew "mosh"
brew "optipng"
brew "pngquant"
brew "postgresql"
brew "pre-commit"
brew "re2c"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "unzip"
brew "whalebrew"
brew "wxmac"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "thoughtbot/formulae/rcm"
brew "xwmx/taps/nb"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "insomnia"
cask "iterm2"
