tap "d12frosted/emacs-plus"
tap "github/gh"
tap "go-task/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "supabase/tap"
tap "superfly/tap"
tap "thoughtbot/formulae"
tap "wix/brew"
tap "xwmx/taps"
# Run your GitHub Actions locally 🚀
brew "act"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Image manipulation library
brew "jpeg", link: true
# Library for manipulating PNG images
brew "libpng"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line DNS client
brew "dog"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# C XSLT library for GNOME
brew "libxslt"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql"
# Modern shell for the GitHub era
brew "nushell"
# PNG file optimizer
brew "optipng"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PNG image optimizing utility
brew "pngquant"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Generic syntax highlighter
brew "pygments"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-native-comp", "with-nobu417-big-sur-icon"]
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Supabase CLI
brew "supabase/tap/supabase"
brew "superfly/tap/flyctl"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# Apple simulator utilities
brew "wix/brew/applesimutils"
brew "xwmx/taps/nb"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Data backup and storage service
cask "backblaze"
# Menu bar icon organizer
cask "bartender"
# Web browser focusing on privacy
cask "brave-browser"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# GPU-based terminal emulator
cask "kitty"
# Productivity tool
cask "launchbar"
# Online collaborative whiteboard platform
cask "miro"
# Free and open-source RSS reader
cask "netnewswire"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Remote pair programming
cask "pop"
# GUI client for PostgreSQL databases
cask "postico"
# Emoji picker optimized for blind people
cask "rocket"
# Development environment
cask "vagrant"
# Virtualizer for x86 hardware
cask "virtualbox"
# Extend the functionality of VirtualBox
cask "virtualbox-extension-pack"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Agenda", id: 1287445660
mas "Boop", id: 1518425043
mas "Castaways", id: 1474344996
mas "Cat Quest II", id: 1466977536
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Drafts", id: 1435957248
mas "Gifski", id: 1351639930
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "OmniGraffle", id: 1142578753
mas "OneTab", id: 1540160809
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Super Agent", id: 1568262835
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
