tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "xwmx/taps"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Cross-platform make
brew "cmake"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line DNS client
brew "dog"
# Portable Foreign Function Interface library
brew "libffi"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GitHub command-line tool
brew "gh"
# Image manipulation library
brew "jpeg"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# PNG file optimizer
brew "optipng"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PNG image optimizing utility
brew "pngquant"
# Object-relational database system
brew "postgresql"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Homebrew, but with Docker images
brew "whalebrew"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
brew "xwmx/taps/nb"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Menu bar icon organizer
cask "bartender"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GUI client for PostgreSQL databases
cask "postico"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# AMD64/Intel64 and x86 virtualization
cask "virtualbox-extension-pack"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Agenda", id: 1287445660
mas "Boop", id: 1518425043
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Drafts", id: 1435957248
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "OmniGraffle", id: 1142578753
mas "OneTab", id: 1540160809
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
