tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/core"
tap "jhawthorn/fzy"
tap "kryptco/tap"
tap "neovim/neovim"
tap "thoughtbot/formulae"
brew "antigen"
brew "autoconf"
brew "pcre"
brew "exa"
brew "mpfr"
brew "gcc"
brew "gdbm"
brew "perl"
brew "git"
brew "sqlite"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "python"
brew "libyaml"
brew "mongodb"
brew "mysql"
brew "neovim"
brew "node"
brew "postgresql"
brew "pv"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "ruby"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus"
brew "jhawthorn/fzy/fzy"
brew "thoughtbot/formulae/rcm"
cask "ngrok"
